In [ ]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [7]:
%%sql
create database besant;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [8]:
%%sql
use besant;
create table student (
    id int primary key,
    name varchar(50),
    age int,
    city varchar(50)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
describe student;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, ''),
 ('city', 'varchar(50)', 'YES', '', None, '')]

In [3]:
%%sql
use besant;
SELECT * FROM EMPLOYEE;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
2 rows affected.

[(1, 'VISWAA', 'VISWAAESWARAN@GMAIL.COM', 21, 'ACTIVE'),
 (2, 'SATHISH', 'SATHISH@GMAIL.COM', 22, 'active')]